Revit 2024 API
BRepBuilderGeometryId.InvalidGeometryId Method
 Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static BRepBuilderGeometryId InvalidGeometryId()
Visual Basic
Public Shared Function InvalidGeometryId As BRepBuilderGeometryId
Visual C++
public:
static BRepBuilderGeometryId^ InvalidGeometryId()
See Also
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace